In [2]:
import pandas as pd

In [3]:
import numpy as np

In [4]:
df = pd.read_csv('nba.csv')

In [5]:
df.columns

Index(['Name', 'Team', 'Number', 'Position', 'Age', 'Height', 'Weight',
       'College', 'Salary'],
      dtype='object')

In [6]:
df.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0

In [41]:
df.shape

(458, 9)

In [42]:
df.isnull().sum()

Name         1
Team         1
Number       1
Position     1
Age          1
Height       1
Weight       1
College     85
Salary      12
dtype: int64

In [43]:
null_row = df[df['Name'].isnull()]
print(null_row)

    Name Team  Number Position  Age Height  Weight College  Salary
457  NaN  NaN     NaN      NaN  NaN    NaN     NaN     NaN     NaN

In [44]:
df.loc[456]

Name        Jeff Withey
Team          Utah Jazz
Number             24.0
Position              C
Age                26.0
Height              7-0
Weight            231.0
College          Kansas
Salary         947276.0
Name: 456, dtype: object

In [48]:
df.drop(index=457,inplace=True)

In [49]:
df.isnull().sum()

Name         0
Team         0
Number       0
Position     0
Age          0
Height       0
Weight       0
College     84
Salary      11
dtype: int64

In [50]:
df.loc[456]

Name        Jeff Withey
Team          Utah Jazz
Number             24.0
Position              C
Age                26.0
Height              7-0
Weight            231.0
College          Kansas
Salary         947276.0
Name: 456, dtype: object

In [52]:
# Now to find relation betwen columns i'll use correlation
result = df.corr()
print(result)

ValueError: could not convert string to float: 'Avery Bradley'

In [53]:
df.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0

In [55]:
df = df.astype(
    {
        'Age': 'int',
        'Number': 'int'
    }
)

In [56]:
df.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0,PG,25,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99,SF,25,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30,SG,27,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28,SG,22,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8,PF,29,6-10,231.0,NaN,5000000.0

In [57]:
mode_value = df['Salary'].mode()[0]

df['Salary'].fillna(mode_value, inplace=True)

C:\Users\Dushyant\AppData\Local\Temp\ipykernel_28788\2427558839.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Salary'].fillna(mode_value, inplace=True)

In [58]:
df.isnull().sum()

Name         0
Team         0
Number       0
Position     0
Age          0
Height       0
Weight       0
College     84
Salary       0
dtype: int64

In [60]:
df.info

<bound method DataFrame.info of               Name            Team  Number Position  Age Height  Weight  \
0    Avery Bradley  Boston Celtics       0       PG   25    6-2   180.0
1      Jae Crowder  Boston Celtics      99       SF   25    6-6   235.0
2     John Holland  Boston Celtics      30       SG   27    6-5   205.0
3      R.J. Hunter  Boston Celtics      28       SG   22    6-5   185.0
4    Jonas Jerebko  Boston Celtics       8       PF   29   6-10   231.0
..             ...             ...     ...      ...  ...    ...     ...
452     Trey Lyles       Utah Jazz      41       PF   20   6-10   234.0
453   Shelvin Mack       Utah Jazz       8       PG   26    6-3   203.0
454      Raul Neto       Utah Jazz      25       PG   24    6-1   179.0
455   Tibor Pleiss       Utah Jazz      21        C   26    7-3   256.0
456    Jeff Withey       Utah Jazz      24        C   26    7-0   231.0

               College     Salary
0                Texas  7730337.0
1            Marquette  6796117.0
2    Boston University   947276.0
3        Georgia State  1148640.0
4                  NaN  5000000.0
..                 ...        ...
452           Kentucky  2239800.0
453             Butler  2433333.0
454                NaN   900000.0
455                NaN  2900000.0
456             Kansas   947276.0

[457 rows x 9 columns]>

In [7]:
df.describe()

           Number         Age      Weight        Salary
count  457.000000  457.000000  457.000000  4.460000e+02
mean    17.678337   26.938731  221.522976  4.842684e+06
std     15.966090    4.404016   26.368343  5.229238e+06
min      0.000000   19.000000  161.000000  3.088800e+04
25%      5.000000   24.000000  200.000000  1.044792e+06
50%     13.000000   26.000000  220.000000  2.839073e+06
75%     25.000000   30.000000  240.000000  6.500000e+06
max     99.000000   40.000000  307.000000  2.500000e+07

In [28]:
numeric_df = df.select_dtypes(include='number')

In [29]:
numeric_df.head()

   Number   Age  Weight     Salary
0     0.0  25.0   180.0  7730337.0
1    99.0  25.0   235.0  6796117.0
2    30.0  27.0   205.0        NaN
3    28.0  22.0   185.0  1148640.0
4     8.0  29.0   231.0  5000000.0

In [25]:
# standardization

def standardized(df):
    standardized_df = df.copy()
    for col in df.columns:
        mean_value = df[col].mean()
        sd = df[col].std()

        if sd != 0:
            standardized_df[col] = (df[col] - mean_value)/sd
        else:
            standardized_df[col] = 0

    return standardized_df

In [31]:
print("Before Standardization: \n", numeric_df.head())

Before Standardization:
    Number   Age  Weight     Salary
0     0.0  25.0   180.0  7730337.0
1    99.0  25.0   235.0  6796117.0
2    30.0  27.0   205.0        NaN
3    28.0  22.0   185.0  1148640.0
4     8.0  29.0   231.0  5000000.0

In [32]:
standardized_df = standardized(numeric_df)

In [33]:
print("After Standardization: \n", standardized_df.head())

After Standardization:
      Number       Age    Weight    Salary
0 -1.107243 -0.440219 -1.574728  0.552213
1  5.093399 -0.440219  0.511106  0.373560
2  0.771740  0.013912 -0.626622       NaN
3  0.646474 -1.121415 -1.385107 -0.706421
4 -0.606181  0.468043  0.359409  0.030084

In [36]:
df['Team'].unique()

array(['Boston Celtics', 'Brooklyn Nets', 'New York Knicks',
       'Philadelphia 76ers', 'Toronto Raptors', 'Golden State Warriors',
       'Los Angeles Clippers', 'Los Angeles Lakers', 'Phoenix Suns',
       'Sacramento Kings', 'Chicago Bulls', 'Cleveland Cavaliers',
       'Detroit Pistons', 'Indiana Pacers', 'Milwaukee Bucks',
       'Dallas Mavericks', 'Houston Rockets', 'Memphis Grizzlies',
       'New Orleans Pelicans', 'San Antonio Spurs', 'Atlanta Hawks',
       'Charlotte Hornets', 'Miami Heat', 'Orlando Magic',
       'Washington Wizards', 'Denver Nuggets', 'Minnesota Timberwolves',
       'Oklahoma City Thunder', 'Portland Trail Blazers', 'Utah Jazz',
       nan], dtype=object)

In [37]:
df['Position'].unique()

array(['PG', 'SF', 'SG', 'PF', 'C', nan], dtype=object)

In [38]:
df['College'].unique()

array(['Texas', 'Marquette', 'Boston University', 'Georgia State', nan,
       'LSU', 'Gonzaga', 'Louisville', 'Oklahoma State', 'Ohio State',
       'Washington', 'Kentucky', 'North Carolina', 'Arizona',
       'Georgia Tech', 'Cincinnati', 'Miami (FL)', 'Stanford', 'Syracuse',
       'Saint Louis', 'Kansas', 'Georgetown', 'Texas A&M', 'UCLA', 'UNLV',
       'Wichita State', "Saint Joseph's", 'Notre Dame', 'Norfolk State',
       'Duke', 'Murray State', 'Tennessee State', 'Bowling Green',
       'Purdue', 'Wake Forest', 'Michigan', 'Missouri', 'USC',
       'Villanova', 'Rider', 'Utah', 'Belmont', 'Davidson', 'Vanderbilt',
       'Michigan State', 'Florida', 'Washington State', 'Arizona State',
       'Oklahoma', 'Wyoming', "St. John's", 'Maryland', 'Wisconsin',
       'Utah Valley', 'North Carolina State', 'UC Santa Barbara',
       'Baylor', 'Connecticut', 'Oregon State', 'New Mexico', 'Oregon',
       'Creighton', 'Arkansas', 'Memphis', "Saint Mary's", 'Tennessee',
       'Alabama', 'Georgia', 'Colorado', 'Boston College', 'Temple',
       'Fresno State', 'IUPUI', 'Eastern Washington', 'Western Michigan',
       'Virginia', 'Northeastern', 'Western Kentucky', 'Nevada',
       'Illinois', 'Kansas State', 'Charleston', 'Clemson',
       'Blinn College', 'Providence', 'Detroit', 'Rhode Island',
       'California', 'Cleveland State', 'Iowa State', 'Florida State',
       'Long Beach State', 'Penn State', 'Indiana', 'San Diego State',
       'Western Carolina', 'Houston', 'Xavier', 'Old Dominion',
       'Minnesota', 'Louisiana Tech', 'Bucknell', 'Pittsburgh',
       'Virginia Commonwealth', 'Harvard', 'Marshall', 'Iowa',
       'St. Bonaventure', 'Louisiana-Lafayette', 'Colorado State',
       'Virginia Tech', 'DePaul', 'Morehead State', 'Central Michigan',
       'Weber State', 'Lehigh', 'Westchester CC', 'Dayton', 'Butler'],
      dtype=object)

In [50]:
from sklearn.impute import SimpleImputer
from sklearn.preprocessing import OneHotEncoder

In [40]:
imputer = SimpleImputer(strategy='most_frequent')

In [46]:
df[['Team','Position','College']] = imputer.fit_transform(df[['Team','Position','College']])

In [47]:
df

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,Kentucky,5000000.0
...,...,...,...,...,...,...,...,...,...
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
454,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,Kentucky,900000.0
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,Kentucky,2900000.0
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0
457,NaN,New Orleans Pelicans,NaN,SG,NaN,NaN,NaN,Kentucky,NaN

In [48]:
df.isnull().sum()

Name         1
Team         0
Number       1
Position     0
Age          1
Height       1
Weight       1
College      0
Salary      12
dtype: int64

In [56]:
# one hot encoding
ohe = OneHotEncoder(sparse_output=False, drop='first')
one_hot_encoded = ohe.fit_transform(df[['Team','Position','College']])

encoded_df = pd.DataFrame(one_hot_encoded, columns= ohe.get_feature_names_out(['Team','Position','College']))

df = pd.concat([df, encoded_df], axis=1)

df.head(4)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary,Team_Boston Celtics,...,College_Washington State,College_Weber State,College_Westchester CC,College_Western Carolina,College_Western Kentucky,College_Western Michigan,College_Wichita State,College_Wisconsin,College_Wyoming,College_Xavier
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0,1.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0,1.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN,1.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0,1.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [59]:
df.columns

Index(['Name', 'Team', 'Number', 'Position', 'Age', 'Height', 'Weight',
       'College', 'Salary', 'Team_Boston Celtics',
       ...
       'College_Washington State', 'College_Weber State',
       'College_Westchester CC', 'College_Western Carolina',
       'College_Western Kentucky', 'College_Western Michigan',
       'College_Wichita State', 'College_Wisconsin', 'College_Wyoming',
       'College_Xavier'],
      dtype='object', length=609)

In [57]:
df["Team"].unique()

array(['Boston Celtics', 'Brooklyn Nets', 'New York Knicks',
       'Philadelphia 76ers', 'Toronto Raptors', 'Golden State Warriors',
       'Los Angeles Clippers', 'Los Angeles Lakers', 'Phoenix Suns',
       'Sacramento Kings', 'Chicago Bulls', 'Cleveland Cavaliers',
       'Detroit Pistons', 'Indiana Pacers', 'Milwaukee Bucks',
       'Dallas Mavericks', 'Houston Rockets', 'Memphis Grizzlies',
       'New Orleans Pelicans', 'San Antonio Spurs', 'Atlanta Hawks',
       'Charlotte Hornets', 'Miami Heat', 'Orlando Magic',
       'Washington Wizards', 'Denver Nuggets', 'Minnesota Timberwolves',
       'Oklahoma City Thunder', 'Portland Trail Blazers', 'Utah Jazz'],
      dtype=object)

In [58]:
df["Team_Boston Celtics"].unique()

AttributeError: 'DataFrame' object has no attribute 'unique'